alice_in_wonderland = '''"Would you tell me, please, which way I ought to go from here?"
"That depends a good deal on where you want to get to," said the Cat.
"I don't much care where ——" said Alice.
"Then it doesn't matter which way you go," said the Cat.
"—— so long as I get somewhere," Alice added as an explanation.
"Oh, you're sure to do that," said the Cat, "if you only walk long enough."'''
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк

lapky = alice_in_wonderland.count("'")
print(lapky)

print(alice_in_wonderland)

"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
chorne_more = 436402
azovske_more = 37800
zahalna_ploshcha = chorne_more + azovske_more
print(f"Чорне і Азовське море разом займають площу {zahalna_ploshcha} квадратних кілометрів")

# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
vsoho_tovariv = 375291
sklad1_i2 = 250449
sklad2_i3 = 222950
sklad3 = vsoho_tovariv - sklad1_i2
sklad1 = vsoho_tovariv - sklad2_i3
sklad2 = vsoho_tovariv - (sklad1 + sklad3)
print(f"на першому складі {sklad1}  товарів, на другому складі {sklad2} товарів, на третьому складі {sklad3} товарів")


# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
kilkist_misiatsiv = 18
tsina_na_misiats = 1179
vartist = kilkist_misiatsiv * tsina_na_misiats
print(f"вартість комп'ютера складе {vartist} гривень")


# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""

a_ost = 8019 % 8
b_ost = 9907 % 9
c_ost = 2789 % 5
d_ost = 7248 % 6
e_ost = 7128 % 5
f_ost = 19224 % 9
print(f"a) Остача від ділення 8019 на 8 дорівнює: {a_ost}")
print(f"b) Остача від ділення 9907 na 9 дорівнює: {b_ost}")
print(f"c) Остача від ділення 2789 на 5 дорівнює: {c_ost}")
print(f"d) Остача від ділення 7248 на 6 дорівнює: {d_ost}")
print(f"e) Остача від ділення 7128 на 5 дорівнює: {e_ost}")
print(f"f) Остача від ділення 19224 на 9 дорівнює: {f_ost}")



# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
pitsa_velyka = 274 * 4
pitsa_serednia = 218 * 2
sik = 35 * 4
tort = 350
voda = 21 * 3
zamovlennia = pitsa_velyka + pitsa_serednia + sik + tort + voda
print(f"всього на замовлення знадобиться {zamovlennia} гривень")

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
storinky = 232 // 8
print(f"Ігорю знадобиться {storinky} сторінок")

# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
vidstan = 1600
vytrata_na100km = 9
mistkist = 48
neobhidno_benzynu = vidstan // 100 * vytrata_na100km
bakiv = neobhidno_benzynu // mistkist
raziv = bakiv - 1

print(f"для подорожі знадобиться {neobhidno_benzynu} літрів")
print(f"щонайменше родині доведеться зупинитися {raziv} раз")